; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	thermograph0 - mode
	spectrograph4 - mode
	image1 - mode
	image2 - mode
	infrared3 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	Star1 - direction
	Star2 - direction
	Star4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph0)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
	(supports instrument2 spectrograph4)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star4)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star4)
	(supports instrument5 image2)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument6 spectrograph4)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 image1)
	(supports instrument7 image2)
	(supports instrument7 infrared3)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 infrared3)
	(supports instrument8 thermograph0)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star9)
	(supports instrument9 thermograph0)
	(supports instrument9 image1)
	(supports instrument9 image2)
	(calibration_target instrument9 GroundStation3)
	(supports instrument10 image2)
	(supports instrument10 image1)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 Star1)
	(supports instrument11 thermograph0)
	(supports instrument11 image2)
	(supports instrument11 infrared3)
	(calibration_target instrument11 Star2)
	(supports instrument12 thermograph0)
	(supports instrument12 spectrograph4)
	(calibration_target instrument12 Star4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star2)
)
(:goal (and
	(pointing satellite0 Planet8)
	(pointing satellite1 GroundStation0)
	(pointing satellite4 GroundStation0)
	(have_image Star5 spectrograph4)
	(have_image Phenomenon6 infrared3)
	(have_image Planet7 image2)
	(have_image Planet8 image1)
	(have_image Star9 spectrograph4)
))

)

; plan
1. (turn_to satellite1 groundstation3 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 8
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 8
3. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 0 of 8
4. (turn_to satellite1 star9 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star9)
   goals met: 0 of 8
5. (take_image satellite1 star9 instrument2 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 1 of 8
6. (turn_to satellite1 star5 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star5)
   goals met: 1 of 8
7. (take_image satellite1 star5 instrument2 spectrograph4)
   added: (have_image star5 spectrograph4)
   goals met: 2 of 8
8. (turn_to satellite1 planet8 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet8)
   goals met: 2 of 8
9. (turn_to satellite0 planet8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet8)
   goals met: 3 of 8
10. (take_image satellite1 planet8 instrument2 image1)
   added: (have_image planet8 image1)
   goals met: 4 of 8
11. (switch_on instrument11 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument11)
   goals met: 4 of 8
12. (calibrate satellite4 instrument11 star2)
   added: (calibrated instrument11)
   goals met: 4 of 8
13. (turn_to satellite1 groundstation0 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation0)
   goals met: 5 of 8
14. (turn_to satellite4 phenomenon6 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon6)
   goals met: 5 of 8
15. (take_image satellite4 phenomenon6 instrument11 infrared3)
   added: (have_image phenomenon6 infrared3)
   goals met: 6 of 8
16. (turn_to satellite4 planet7 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 planet7)
   goals met: 6 of 8
17. (take_image satellite4 planet7 instrument11 image2)
   added: (have_image planet7 image2)
   goals met: 7 of 8
18. (turn_to satellite4 groundstation0 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 groundstation0)
   goals met: 8 of 8
